# ExportScope Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions..::..ExportScope Property
NavisworksExportOptions Class See Also
---
Options which specifies the export scope of Navisworks Exporter. Default value is Model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public NavisworksExportScope ExportScope { get; set; }
```

Visual Basic
---
```text
Public Property ExportScope As NavisworksExportScope
	Get
	Set
```

Visual C++
---
```text
public:
property NavisworksExportScope ExportScope {
	NavisworksExportScope get ();
	void set (NavisworksExportScope value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace